CSI API ETABS v1

# cGenDispl Interface

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public interface cGenDispl

    Public Interface cGenDispl

    Dim instance As cGenDispl

    public interface class cGenDispl

    type cGenDispl =  interface end

The cGenDispl type exposes the following members.

Methods

| Name| Description
---|---|---
|
Add|
|
ChangeName|
|
Count|
|
CountPoint|
|
Delete|
|
DeletePoint|
|
GetNameList|
|
GetPoint|
|
GetTypeGenDispl|
|
GetTypeOAPI|
|
SetPoint|
|
SetType|
|
SetTypeOAPI|
Top

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com